In [3]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd
import os
import seaborn
import japanize_matplotlib
import cryptography

In [4]:
def get_connection():
    engine = create_engine(f"mysql+pymysql://loganalysis:{os.getenv('LOGANALYSIS_PASSWORD')}@localhost/primary_app_db", pool_recycle=3600)
    return engine.connect()

In [5]:
con = get_connection()

In [8]:
con.execute("""
drop table if exists users2;
""")
con.execute("""
create table users2 as
select
  1 as id,
  "a" as name;
""")

In [9]:
pd.read_sql("""
select * from users2
""", con)

   id name
0   1    a